Repository: hawkeye116477/install-waterfox-linux
Catalog: src/locales/common/*.po
Languages: pl

source: Making {installPath} directory...
pl: Usuwanie katalogu {installPath}...

source: Removing older installed version...
pl: Usuwanie starszej zainstalowanej wersji....

source: Unpackaging {package} into {installPath} directory...
pl: Wypakowywanie {package} do katalogu {installPath}...

source: Creating executable file...
pl: Tworzenie pliku wykonywalnego...

source: Generating start menu shortcut...
pl: Generowanie skrótu do menu start...

source: Creating symlinks to icons...
pl: Tworzenie dowiązań symbolicznych do ikon...

source: Refreshing icons cache...
pl: Odświeżanie pamięci podręcznej ikon...

source: Installing desktop shortcut...
pl: Instalowanie skrótu na pulpicie...

source: Adding path to system's dictionaries...
pl: Dodawanie ścieżki do systemowych słowników...

source: Removing {sourcePath} ...
pl: Usuwanie {sourcePath} ...

source: Saving settings...
pl: Zapisywanie ustawień...

source: Waterfox {chosenPackageType} has been installed in {installPath} {grinningFace}!
pl: Waterfox {chosenPackageType} został zainstalowany w {installPath} {grinningFace}!

source: Removing {appPath} directory...
pl: Usuwanie katalogu {appPath}...

source: Removing executable file...
pl: Usuwanie pliku wykonywalnego...

source: Root priveleges are required to remove {execFile}!
pl: Do usunięcia {execFile} wymagane są uprawnienia roota!

source: Removing start menu shortcut...
pl: Usuwanie skrótu w menu start....

source: Root priveleges are required to remove {path}!
pl: Do usunięcia {path} wymagane są uprawnienia roota!

source: Removing desktop shortcut...
pl: Usuwanie skrótu na pulpicie...

source: Removing {file} ...
pl: Usuwanie {file} ...

source: Root priveleges are required to remove symlinks to icons!
pl: Aby usunąć symlinki do ikon, wymagane są uprawnienia roota!

source: Removing empty {installPath} directory...
pl: Usuwanie pustego katalogu {installPath}...

source: Removing file with installer settings...
pl: Usuwanie pliku z ustawieniami instalatora...

source: Waterfox {chosenPackageType} has been uninstalled {disappointedFace}.
pl: Waterfox {chosenPackageType} został odinstalowany {disappointedFace}.
